
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |    Add |   🟡 Change |   🔴 Destroy |
|----------:|-------:|------------:|-------------:|
|        ✅ |      0 |          25 |            1 |
## Affected resources by action

|  Action  | Resources                                                                  |
|:--------:|:---------------------------------------------------------------------------|
|    🟡    | `module.infrahouse-github-backup-app-key.aws_secretsmanager_secret.secret` |
|    🟡    | `module.jumphost.aws_autoscaling_group.jumphost`                           |
|    🟡    | `module.jumphost.aws_efs_file_system.home-enc`                             |
|    🟡    | `module.jumphost.aws_iam_policy.required`                                  |
|    🟡    | `module.jumphost.aws_launch_template.jumphost`                             |
|    🟡    | `module.jumphost.aws_lb.jumphost`                                          |
|    🟡    | `module.kc_db_password.aws_secretsmanager_secret.secret`                   |
|    🟡    | `module.keycloak_admin_password.aws_secretsmanager_secret.secret`          |
|    🟡    | `module.mail_twindb_com.aws_autoscaling_group.postfix`                     |
|    🟡    | `module.mail_twindb_com.aws_efs_file_system.mail`                          |
|    🟡    | `module.mail_twindb_com.aws_iam_policy.required`                           |
|    🟡    | `module.mail_twindb_com.aws_launch_template.postfix`                       |
|    🟡    | `module.mail_twindb_com.aws_lb.postfix`                                    |
|    🟡    | `module.mail_twindb_com.aws_lb_target_group.postfix`                       |
|    🟡    | `module.mail_twindb_com.aws_security_group.efs`                            |
|    🟡    | `module.mail_twindb_com.aws_security_group.postfix`                        |
|    🟡    | `module.mail_twindb_com.aws_vpc_security_group_egress_rule.default`        |
|    🟡    | `module.mail_twindb_com.aws_vpc_security_group_egress_rule.efs`            |
|    🟡    | `module.mail_twindb_com.aws_vpc_security_group_ingress_rule.efs`           |
|    🟡    | `module.mail_twindb_com.aws_vpc_security_group_ingress_rule.efs_icmp`      |
|    🟡    | `module.mail_twindb_com.aws_vpc_security_group_ingress_rule.icmp`          |
|    🟡    | `module.mail_twindb_com.aws_vpc_security_group_ingress_rule.smtp`          |
|    🟡    | `module.mail_twindb_com.aws_vpc_security_group_ingress_rule.ssh`           |
|    🟡    | `module.smtp_credentials.aws_secretsmanager_secret.secret`                 |
|    🟡    | `module.jumphost.module.jumphost_profile.aws_iam_policy.profile`           |
|    🔴    | `module.jumphost.aws_efs_replication_configuration.home`                   |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrahouse-github-backup-app-key.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/infrahouse-github-backup-app-key/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:493370826424:secret:infrahouse-github-backup20241008175604274900000001-WxRbWT",
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.infrahouse-github-backup-app-key.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:infrahouse-github-backup20241008175604274900000001-WxRbWT"
        name                           = "infrahouse-github-backup20241008175604274900000001"
      ~ tags                           = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/secret/aws"
            "environment"       = "production"
          + "module_version"    = "1.0.3"
            "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
            "service"           = "unknown"
        }
      ~ tags_all                       = {
          + "module_version"    = "1.0.3"
            # (6 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.jumphost.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ",
            ]
        }
    }

  # module.jumphost.aws_autoscaling_group.jumphost will be updated in-place
  ~ resource "aws_autoscaling_group" "jumphost" {
        id                               = "jumphost-20240223005113359100000009-02R7BZ"
        name                             = "jumphost-20240223005113359100000009-02R7BZ"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "29" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (11 unchanged blocks hidden)
    }

  # module.jumphost.aws_efs_file_system.home-enc will be updated in-place
  ~ resource "aws_efs_file_system" "home-enc" {
        id                              = "fs-0ab965ea5b50e59a9"
        name                            = "jumphost-home-encrypted"
        tags                            = {
            "Name"              = "jumphost-home-encrypted"
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (14 unchanged attributes hidden)

      ~ protection {
          ~ replication_overwrite = "REPLICATING" -> "DISABLED"
        }
    }

  # module.jumphost.aws_efs_replication_configuration.home will be destroyed
  # (because aws_efs_replication_configuration.home is not in configuration)
  - resource "aws_efs_replication_configuration" "home" {
      - creation_time                   = "2025-08-05 21:59:02 +0000 UTC" -> null
      - id                              = "fs-0cbd3749548d04da6" -> null
      - original_source_file_system_arn = "arn:aws:elasticfilesystem:us-west-1:493370826424:file-system/fs-0cbd3749548d04da6" -> null
      - source_file_system_arn          = "arn:aws:elasticfilesystem:us-west-1:493370826424:file-system/fs-0cbd3749548d04da6" -> null
      - source_file_system_id           = "fs-0cbd3749548d04da6" -> null
      - source_file_system_region       = "us-west-1" -> null

      - destination {
          - file_system_id         = "fs-0ab965ea5b50e59a9" -> null
          - region                 = "us-west-1" -> null
          - status                 = "ENABLED" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.jumphost.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-20240223005145929800000014"
        name             = "terraform-20240223005145929800000014"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ec2:DescribeInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (7 unchanged attributes hidden)
    }

  # module.jumphost.aws_launch_template.jumphost will be updated in-place
  ~ resource "aws_launch_template" "jumphost" {
        id                                   = "lt-001743d1d2257c40b"
      ~ latest_version                       = 29 -> (known after apply)
        name                                 = "jumphost-20240223005113359100000009"
        tags                                 = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
      ~ user_data                            = "H4sIAAAAAAAA/7x6WZOrSJLu+zHr/5CWd96oPOwS1LV6ALFKiE0glqmxY+z7vtPT//1aSqcyq6r7TveZMRs9SBDhfB7u4V8E4a5TU49RPb4ZWxv9/FJN5Zi1Xj+CVbZG4f998ZupDr1+++X1Kl5ZWjFlhtKd1y/vd2/3qB+ypv75Bf4K/eXLX768vf1e6C9fPrB7rx7iqH9j66AJszr5+eXoZ+PvBB7Kx2gdwaBspvAtaOo4S/7y5ZpV0d+p+T+/l/ny6rXj689fXl5eh2bqg2h43Ly8vGZ13HtpMw3R95aXl9ci2l5/fvnP77cvL2/vH5rlRflF5dUX1aQl8fRyYZ0XWlJOl0f3lw/pShNlmvd8nDVpljqtEUXsDc06Tre3ZEDndjMxropsU3xkbuqN3dfAP9R34JKJ7UFC+w+gWjGUOoPgsJWPOju1UNkCO39iZYuBMlnvhUSB6kL2JuZGo1hBJNlkSws+3IBh63pi+gASR6isqm6rwmtXVS3MMDMjVL4+e6AU8G5st9atmeVlkQB+5Xevq7f67INIeSE1hJuwDyCMkbgTeN9CNL4VfKxXWdun54AkopXAOGCCmUC0lYkeWDbeyuKMGXLv9RDKX+HU1u/kBxBhaUf6lKWy4JD5jEIZSCpMqsfCGCbnKqANgZrCM2DBNoLgnVCbvg8fkJ4T9VNDu2D0AQQR24ZTyZLMxHxIFimuptYT8s4WwJOe8tZ53Gx/hhBpvJqOnlJ5EsXW4Cigt26CCfgfQPeUP/P52dlF2YTTg3qH+2ntkoWtli5e5qxL6bicd4ePmEBVUmNnrjyHNv61Fw6FpX/6iMbTqUlO5GTsKAl32SxnE2aeQPq4u61r6Cua1WKgH4sAsNuj11auG92j9QisPqbkePUBBCPn8wkrOi0nNEhwbeByr+kgO+1rL+/AXGpwx4O3wN7hCF1UVPZhNuc5wDA9tVDQWfqc/hue0NbpvBIEGpQHp3BshTIP00IKDuq0N2kYqZZhklU85BPUEjoLCIrEnTdOUpZzfP0ACuo+lm6yqE122LI56sWmPKQ+hiu67UqZZTIFdHTDrCczADyz2E3hWn0qKWOhdEqj6A+gkYPPfuVujpnOoS2XIkenDjKmLnLfxFPau3aRuBW5iYLcugje+lWQ3K0z7Nc6LPL4/AHkVGspCucy4Mnds/U5qItWZNbFseTescIyyODJR86Da9LtQ6H1VChV8uwbh/MHEFUGLLuwIsWylqjdqvMxRCi6kFp90mRONaI08b1zb/GaeXLbudA10acW80wR55qizE9nn7REoBIxoxLnfkoK8bSILJeIDKWJEb2IdkJRl5POfAIa+cCApCEra3QJjcMHED6CNKQtRQmsPXi7u5Vn4qDss4ttzRjUoAA5rDpP3WoNInf24Ld8uF/Cjr2rXNRM3OXTRxEzCoZyQSBgyCZfaJEZMyCaWa+IzPMj2S8MV87g+VTHx6z3jaW/dUFD2v31cBtHLPwk7Zw50Yz0N1uIN4avZ752UVwyK2HjuXLbedUkr1F/vA+FLTNEhNDcmh9r3pD8e3g8fProQqtkyDq6D2Oc5HaXee06Pz6PpS0ekiQ8XiezrKHMgeSucMzTKM8qwGe1XAVTVFT08AHkDjWjXGiWsTyoZUh/ry/cIb6f0iXjD5kXCHjtjpGhkbpcXd1UA1gAUq9Fdt68w0Sq+AcQsKpQdiUJrAmS/XKSHDgezpJ25MJ6hRLtfhkvLum31AZSNlgj97GDL3qgqlNRaoavfAYks1L5Ea3KM5jqEWvZ5Am8EuVVSq4MdWU0Xi5ByzhNurottx2eF2ay4dslg+TzTkbHA/MB1Im8jp4FU4QCtT8RZO1U7CRg6iUfAIcJ0+J+XWPhbh0KeLgGfq+zc6MvSNDFfk4ezsoH0PnGUjZbjKFQ+6dCE5ezQaEHtAJI27xgZNEEeJYMisxjwFFomhGIShU6WElUXtTBmvMPoOxk2lUD7lmaqh5mHgG7pO2JCRhD1gtjMAcMmbcxEdvMpXgJVXYR13bfxW5dtEj4oH6aRo+JfM030Q4OKV0qd9V3vbC5W+gsS0ARAX5xYjS9qgCdo3SKmsZOuzRk3SgI1CM9+AF0c2OeJmsEVs5Amq5WkrnpjTMx9rDG5xwyevjq+8k521ZWZPWwDXhUYosbvUpZt3DAp2kBHAkjw+xaSR4I6iIFa5GLHWff4d1Kbyx8M8zddXppHc8SZB+geZOjng960V8Po7F+cg0BDYGiI7exc+nkYZETqHhn27eCyPQay2CWvqGpIGPTiRHakcXVkkRz61xNS8MWjrF+AKUbrh9Xl6cu6oRtQ8xUiWgSmx05xMlfToEHF0Fz364uxrC8uKTwWRQPJWpT6N3qg4b9XEYoAsaoIp6zBjNJCjmwGODxCagl1dxQuNKO7sFrUKsGFVE+DvXKJ95yuo1KZPW2Tm4fQPHZIwTHPjMeaDTsuEGKsSYZu2qWoxqecqBCMDgEni/qXYLa8wkpy5TgeNx6Zy9Wfc4at6Eb0jL5FiALK0m0e2+kI0Ry4ahymJdreHHajrF5RsChOzOFYY8e2vmY3hpcE57Dz10EWsbkEldLzuJgk1MOxSYifa9XdgEHbIeZgCy6VsVUzGTpbiZcu6XbaW+D0UYZ0aE+TWsU82hH8En0hDBVj6Xfb2FzNta+WfSjs0Pj3oxpbsUc1UlwE5E202+Lj0IAebKw+PRpWtPBRLJ7HUspEmFtHDajND8IE+eimKeOcc8P+DU6NZcuIZa9BuNZDKHtMFudN6px8LmwOUONMify6OPEBSFMbWtbUnDIxrsUFKuxFOUUJ5XSHEpLqHPqpPTFqUfUoXhtKnmcgj6ATFI+8PTYVKPj0tr5yal0uNJawSxVQFFUc2blT5ncIFQQ7pWAPF4KJP5cs8PEdNTD4aoBOCzAGZdiUe6gDZSvF7Q4GSwhpr0a3WWxySS3SbVE7Vum1UhPM5Akv3mfpqmUSe50CVjZkGp1z8X7fDcCBVfv0JoaF2ukRzfcuRmyAlEfKzJRHAvnU7qClBinPyP7oDUrT2A1VcV4ZIbJumqdWlt3zqjXdQFQ9FTPCg25joRETX64sVvlIaPTW5I0FobcfVJETm4qtPAWduNqiPJANkOvnH7hzC7jdi/agLm3ijSH7iU+tGsMXw5bmGdlFeHbffDrD6CE28pQJo8GYfUBVgnpVUPBO0wy2/HMAyPr0QeLoQBuX4EOyeGVkFqj5vHUORO2Ql6bD6DjWe9UaBgLdcn3qQoUyw0ZrsIal4CUnVOIc5ipwh3ML050NwsMR4TTxYgIW6SVUKiCD6B2cqh8tDINSMgMMYkboqVl0wSVM4ortulr4pDdHsDHC8fwJTh7+Zahdridpoi5DO3xA0ib8yEJK7niphAhlmkmUrHSDRVRS6RP4CODXoKs0vQa4Dk6z24lfg2XbdzIILfta/S51OIabjKBy5Kmb+Qr4Y+yFNVrdJ0Wm10P0AkgtdvgqJRvr3dT07RRz8/pfp6hNe/u6/gZ2QQen+/w0dz3oHLmTb7YyhLJ86ldrRlknLPMkRjQNA7YN8oZM5ABwaALK/dXIj3IRvS7pTYEkXxaGTXQk8Nt0AtsPFsc1xbUrVdX4nPf+sVNM/aPh0JWZv6LI+FT8PuJ8/Xnl9cw8l/+fciSOgrf/O2Xf7uwzjdOlNj/eEnHsR1+BsE+KiNviN7qxi+jr5+H069BU4Ev/6azEkvdPgdReVn9+uW1aqZ6fD/Svr28vbzGwxsU+CF6xEgcI0IIC73D1ygevk7D2xIN4xv81au8vam9ZXjH/Rl8/fLy/iCYNlX0/bqOB+zzco764RfsK/xTP2R79AsMYQR+PPy0/OEu9frwpzGrouaXAwT91Efj+4n+F+SnuumjYW6bfvzpWx2NYTR/R4Y+f19bLyi8JPo2taE3vntr7Kfoo/lp3GvlFdHr+0USBI/fdmrbaHwLmvDZ/umxt7FpyiIbH8395G9v719JVA2fLY+R/PGp74ChN3qPrjoe3oKmqpp3Pz87n3mEoCnLKBizpn6f2WcP8W7Pa1YPo1eWv5nw2fJt3NpHHHhZ85D8zebaq6JPlDcvierxITCMXj9+G6J+zh4RFHvl8ECcn9mO94eIrzD09d2D/VQHVfjdUe8R8fL2tEGlDOEXsGlH8Kmg9Pzh+yXoZ/XP//Yu8JJE1cv3gb7kw7u9/61HvWV4G8LiLWj66H8IMURBH41D5dVeEvXPmUq/z9A7AaN6zvqmrqJ6fGn7Jpwe0/HHjtYb05e/9k0zfguzPgrGpt/+Bv5O4H3TfXt7F3j7EHj53XAfsfXy9pZmUe99Tyc9+/9x1PwBG/wcFvgA+Lp5VfnQWDXhVEZv/3x84F9/d/c38Pnc8PPfPfO948vLi9e25d/b8P8dWOXVWRwN4wAO2Rh9bdvXL6/DkH4LozIaoyLahg82vjc/G96DMArCwfvW9tn8ZOwzY/a7bJmisvLtJryouninDPZ9ffxcGX2ULv1a3r0T/H7gH8Ocpd4/NI/PfmW+X7J+RU6uRv32od+/vMeVXD5AHETfnRu8ezy7SRbeBqi+XHMTeZc58X+81zRt9YLblYPSlYsR+Gaz/AMk0bCYrKKVT0nrSEFOjOWevRliMgZhK2gWu6/0Fau2ySS4VjySV06u1Gq5A0vv2tjy3Epu+Q1+19JcjMXNvILgnephA3LPXUFOJVtuHEMc/arcQ4HaZMN57xZ/u3+APBtpmma4dhUX+yawd9C/nwPNo5kURNwj6wmwPzB6CmZyG5+v2QlekSKkHUNl2f0BkvkX3FisIp+hxUQcwKft42ks45zhLrL0cGxKnWVrjm73bfOqmQhEdmUD01yZpvOem36KRIHCVZdjOKDccrOfE8CeqEXj6CT45csf9sD/YqJ/i5LJL7PgI0gejW9D6iFvdTaMLYIfXn7EW/9TR/0TH/3yGHiI4DhM/q8H+HV5/x6fkxkgyeha2iYb5qq8C54Y9ZrcXZ4du21IQZgOVTwUJ1rqoJ6HhfIIl9Qp1oSRmfWFoh4glJjoZ1/22Ju1W8kT/UeAHyD/CJ1iqdS+0ph4XUgcHinqoE/CnYKXAlcmLWivDJHcUGS6HOPkAeIFxEbfC+eG9JdNAE0OAksow9ipvw2+GdmzZVJnkooghRR+H3I/EG6/zdofA24Y0rfvXY9AO6GPiSldRoRlg8Uf0XX91wf3rqr/31/9TtwjOMLP4AhqOX10LyxFvQsnLDWaA+0nTtdfzgXlDJznSGt0s4l0k4hLdUBYtHEuCfo8lJUziwniKCeNe1cg6AbwEaGJEGga2mSVV63fb1edoI/xcJ26nEuBvZRvSh0JJqda8M1+rn7VLo3uhum4P1D0GI+ldZRAAhy1GeMwD7sSZsGbcrONF3q7BpiAAdEsIuvNMFchn58nX6f0ok2iMeSoGf65PHS1ZK1KGBpO6LKnrtctqi/u3KUKIFMPrviuWLsuyFuWA+pqCugDhLtLZHdxpXgjGhCVyIAsYudyuMVemnHFBW4mPEV5eOEBXRKAdSIw0lfE0FYGK7io2dOciwTIc8JkCgg3UcnIR324K0FgB/rhshdgUaAmeBjEq8nlqDuaabqtSNUKjjZyhhH1z7yyZU+L3+o6xMwJtSxHqz2lkWJzArDeWJWzUp6FDhO7nkSiusetCnGIj3qhutLFNTf68QFSh3bAIBtEgy4ArTV2Wyuuo3oAnTpgyqeyGSwoVJXYtRUpHh1CiJAzwAC0LVzhWjSfU8wsHO5O6G4PXYCFu4XTF7mbYTi9rDneJVAfHKW1cy2zwTLgKgS1Co7ufdiJ7sDmhvzcm7zUAGeuCoKY7VpJs48QZg/tfl4K+X5uDJ3OkU1ztwt9lY8Ism0yuTvxkRAcK6579fDMIw+I6+kWal3xgccCXAFsLLe7Y9ASErr3q3mqIZePuSBv2g291sNxo3yAJIxm3245KD9rEaf0SlFUgNE41YtUpF22BwGEAJUbyT7vzj+hwXOD+xMXfpQGD5A/c+FHafAA+TMXfpQGD5A/c+FHafAA+TMXfpQG3x37Ry78KA0eIH/mwo/S4OnYP3HhR2nwJOCfuPCjNHi+1/2JCz9KgwfIn7nwpAHFUNpza6AoBb9edAOhM6E0mwPUR9lpjEwxswKHuyMPkPVykVfrLowYYLGSBDt2Uu3Z3WijxjnDSsEu0p1wbM6ZU0uJZdvoRXpnKqVOvesuTU8CNqm5zyfgREHcxrTmyVAPvqeUc1sj1vW20Fdq5tBbpmSBjfhnLtGWDbXSQCh4hEvw4bnGrpEbUhBBtuQVVpgqI/OUIDh26QOX9xxfXrxeJcezJiWpOcG0NesyWF7NE42qMUJmT8cyBTaU1N0WUBRouEGzoczwLTGdBD9rJf3eOJl97rebkW1QfGmuxn0obxuydci2Xpb1+WZz2XQUbYIFI+vENX1/CmquOVdbsiVwwlBudQEadkJIqBQIUIAMaGd6bSwB4HymhMB/Fm3YCVAjmS9nARGmgWQVpOYtp7mNaAZFAWN6swx7CYBLp36g7yUUsJojDZGAGOIqy9WzpD2fjiEbHa9TRbg9ticBioOiEZAcLbCDmJrKdYzubrfVZwXreIhpY9RReeTKRjvT7xfnAVLgEQpdkIsASLq7gIGSQWg+3E++lXI7spQS3QQDWWdHVuGm8Diw1cwcVArXwgUsV++ZXYJBfsrCQ1vV1ws8Tt31nJ+zghOiqFGxQlewsBv1AJD67jw0ET+DDBXUPgPEHQMiHfUs9Rs37ZiAFDMGHcLzZJaVO74J9UgAaz9ZQMJVXT2eutzjLru5Hu8bewnucns4JqW3KdFzebxUJ1+XsrFwY/rxFkTjByfhs/I6VXxHoJwrBlZ2rxL7FqHbJkpxNcFcXhvqFkVW9ZwdxaMqZ5crPYwzZeb6jum2BkfNOEiYfLdTg7ic/TS/V9RtJvuGuIHqbWLkpB6DDZ9I4LnG7qvgrDhud8gEyELKAaejZRwPIn3bEGdBmtAN9Hb1B6/Z/a2FClzY7monQ0mW9+RcPEBI5JpO23Li6IWUM3nrNHuiS8iSkG1bq6ZnN8OezkVsnElvaMHBWnAH2S4wMl6lq6o8Z4fCOhbdhxuLAS5GW31hbd1ttFR1bVZivx8nPp6GDqMZa+UuRGoHJTObAF67Ys9pUvZ8nT7k6e6Y6CB5xxJqLwKN3C0rrg6yXI0d3AOyYE/alXh/E6UpGXfnI4YTV3mrQml2dP6Zrl5vbZUOnoXqUS2MIye5d4zW2ORKuMmtUxt9ndZD4t9LhMAQxxLvkmTxEZhYeOTsFn96vimBV7P2dSNhdfxaWBrtDbAb3QChtSCKR/DEP12PPearQ+Z1yzAWmiCD1oYIk31VQ9h97sVcoDH8pmtwRaGldR/newOrAB6DeBWqzEWLIGRgy9UbT4IQzlx9i5HZRczWam8HSX6+s3lyWwVgi2OLAyush0Zbwo154OuEsoIZdE94yZHNpoDWNDAG2gUrAp/dteM7kTWY8LkDtosHz5Di0lNpqkpcFPqd1U3JObu5M1j3ktskCN4V00+UgiZ5PilTbpgMLXflZNkI+QHCs9fvnj8dal3ZJVO0cwSrEL+oTrDT39TlxF0KP7WgSp54a7GtgDTulMEl3hkgnpvXiupobDjQbZJ2YDH9q99krXNeBbGawAPE3ddYLGC80HO0PmDqIuuXfBp6HkqnZr7i8QMEywHH4/HGgCUobUJ9FyxNsQcDJ89I3N1JPa0EdJGus4LeKWRSpwOf3QKBP5ITz4/rE+TO06sh9M3NQQ1K972YV5l7R3REq5MmkEK39Ho6ZVdlUTZTzwqZ0oEGgdI8yvOcpa/PLUMZ2CB1b+i6R7nm62tkH88CNaIBBUgRNfoAnTaNLZTdobWHzq/gS5Ui8qHicg6nuvNzywB4Y02OQjFbMEyiQWnsyC1gL5HCra4ZP09hlCYy//qRs//7/Mb7cbMfvMdRk34eNbcAYf+4X2sn+LZwE511Q1NpdLbc22Tm8HO8CeK8dH7vGFGadEzYWYSRBBmEnNLSPBq6hLnHlcoNUpdPuGeup1kWV2ERRmDZDt3VEo6KCYuHEAs1k/Tv5/DiXye4llKhnBaKhwHk7g8zuAPwCUzstE/29aa5GpJfoEYQ1z2Jc/xA5D53lg02UoA1u7dHcRByf6TlobK7Lhh9FodhOYUL7dKNnHOadNPs3F3XuWWvr7gvswF6uagYyGlxcDdnpGmLEZS2HAxmeEd0MunbM9nxoqX1VnashMC3KR9nh/jIH/ccHrAUDg6ruzTAOWhmDAEoRTyCVnowr+jIrya+ruEqNL1iADcjNMBuSVbNUsMKvvGCJHheEaYn6C7Lh6F0oyM9lZygKQDFMMzoFRcOwwMzPnKiRtw91jGMDjNYMd/cO1CAmu3OYQuBLK9tsjIhIRwuqi9pAlkfDT5OJd6xmtN8jA794aAcrGz1dYjAyTLARgDOl/Do1JiKcUGwW0GqNypll9UxlqOt3VNU9gu2QTrQttieV6uOuY37MPNt6d7yTMKWcAtAAC6tXd365iZf0XPHqQBhuetK3LpipOPZSKOtvtYnDTarVGZ51T/TtdiwCzr7viSiqJyC8xKmLhANYIvsbtlyfujs1eKne3HE40yO+nGrlzlWZk67xHrhEvdNyWop2KJ9Fun5iK5Krp4vKgEtF3b55Zcvr0ufjdG3OCt/q8cEz79mvv788hqtbdOPL5R1+8awHGVKxjed5UVF/uWj7PS95jGm7/JgNAZg2zfvaF9D0FuGr0P6lIj6KhuGrKmHd0HogGGvf1T2n88cyr+HUexN5fgfz/xUlGRN/antD8r6phnBr94ygM8M/j9WBEF/VvRA/l6X+fa7BPqjWvORQn/9g1jflI9qTj5VbdoM4z8w+7MQEnvBGPWPn+Fr+L3nUSX4F33x+tdfP6siv77+/NdfXwOvDqLy26OcUgfRtz6K+2hIvzX1t6jvm/7X158fhaSffn0NI39Kfnf/p8rJr68///r6X1Ynfn396dfX39dGHo/8z+ojD8zfqhKfeP+tWsYT67PW8s8t+sF6y0PBH8tH/3DIv77+7W8/Egkfc/r1WYz7F4Phh3QE0zA21T9R8Od/bL+9/eXL/wsAAP//227gYhAuAAA=" -> "H4sIAAAAAAAA/7x6WZOrSJLu+zHr/5CWd96oPOwS1LV6ALFKiE0glqmxY+z7vtPT//1aSqcyq6r7TveZMRs9SBDhfB7u4V8E4a5TU49RPb4ZWxv9/FJN5Zi1Xj+CVbZG4f998ZupDr1+++X1Kl5ZWjFlhtKd1y/vd2/3qB+ypv75Bf4K/eXLX768vf1e6C9fPrB7rx7iqH9j66AJszr5+eXoZ+PvBB7Kx2gdwaBspvAtaOo4S/7y5ZpV0d+p+T+/l/ny6rXj689fXl5eh2bqg2h43Ly8vGZ13HtpMw3R95aXl9ci2l5/fvnP77cvL2/vH5rlRflF5dUX1aQl8fRyYZ0XWlJOl0f3lw/pShNlmvd8nDVpljqtEUXsDc06Tre3ZEDndjMxropsU3xkbuqN3dfAP9R34JKJ7UFC+w+gWjGUOoPgsJWPOju1UNkCO39iZYuBMlnvhUSB6kL2JuZGo1hBJNlkSws+3IBh63pi+gASR6isqm6rwmtXVS3MMDMjVL4+e6AU8G5st9atmeVlkQB+5Xevq7f67INIeSE1hJuwDyCMkbgTeN9CNL4VfKxXWdun54AkopXAOGCCmUC0lYkeWDbeyuKMGXLv9RDKX+HU1u/kBxBhaUf6lKWy4JD5jEIZSCpMqsfCGCbnKqANgZrCM2DBNoLgnVCbvg8fkJ4T9VNDu2D0AQQR24ZTyZLMxHxIFimuptYT8s4WwJOe8tZ53Gx/hhBpvJqOnlJ5EsXW4Cigt26CCfgfQPeUP/P52dlF2YTTg3qH+2ntkoWtli5e5qxL6bicd4ePmEBVUmNnrjyHNv61Fw6FpX/6iMbTqUlO5GTsKAl32SxnE2aeQPq4u61r6Cua1WKgH4sAsNuj11auG92j9QisPqbkePUBBCPn8wkrOi0nNEhwbeByr+kgO+1rL+/AXGpwx4O3wN7hCF1UVPZhNuc5wDA9tVDQWfqc/hue0NbpvBIEGpQHp3BshTIP00IKDuq0N2kYqZZhklU85BPUEjoLCIrEnTdOUpZzfP0ACuo+lm6yqE122LI56sWmPKQ+hiu67UqZZTIFdHTDrCczADyz2E3hWn0qKWOhdEqj6A+gkYPPfuVujpnOoS2XIkenDjKmLnLfxFPau3aRuBW5iYLcugje+lWQ3K0z7Nc6LPL4/AHkVGspCucy4Mnds/U5qItWZNbFseTescIyyODJR86Da9LtQ6H1VChV8uwbh/MHEFUGLLuwIsWylqjdqvMxRCi6kFp90mRONaI08b1zb/GaeXLbudA10acW80wR55qizE9nn7REoBIxoxLnfkoK8bSILJeIDKWJEb2IdkJRl5POfAIa+cCApCEra3QJjcMHED6CNKQtRQmsPXi7u5Vn4qDss4ttzRjUoAA5rDpP3WoNInf24Ld8uF/Cjr2rXNRM3OXTRxEzCoZyQSBgyCZfaJEZMyCaWa+IzPMj2S8MV87g+VTHx6z3jaW/dUFD2v31cBtHLPwk7Zw50Yz0N1uIN4avZ752UVwyK2HjuXLbedUkr1F/vA+FLTNEhNDcmh9r3pD8e3g8fProQqtkyDq6D2Oc5HaXee06Pz6PpS0ekiQ8XiezrKHMgeSucMzTKM8qwGe1XAVTVFT08AHkDjWjXGiWsTyoZUh/ry/cIb6f0iXjD5kXCHjtjpGhkbpcXd1UA1gAUq9Fdt68w0Sq+AcQsKpQdiUJrAmS/XKSHDgezpJ25MJ6hRLtfhkvLum31AZSNlgj97GDL3qgqlNRaoavfAYks1L5Ea3KM5jqEWvZ5Am8EuVVSq4MdWU0Xi5ByzhNurottx2eF2ay4dslg+TzTkbHA/MB1Im8jp4FU4QCtT8RZO1U7CRg6iUfAIcJ0+J+XWPhbh0KeLgGfq+zc6MvSNDFfk4ezsoH0PnGUjZbjKFQ+6dCE5ezQaEHtAJI27xgZNEEeJYMisxjwFFomhGIShU6WElUXtTBmvMPoOxk2lUD7lmaqh5mHgG7pO2JCRhD1gtjMAcMmbcxEdvMpXgJVXYR13bfxW5dtEj4oH6aRo+JfM030Q4OKV0qd9V3vbC5W+gsS0ARAX5xYjS9qgCdo3SKmsZOuzRk3SgI1CM9+AF0c2OeJmsEVs5Amq5WkrnpjTMx9rDG5xwyevjq+8k521ZWZPWwDXhUYosbvUpZt3DAp2kBHAkjw+xaSR4I6iIFa5GLHWff4d1Kbyx8M8zddXppHc8SZB+geZOjng960V8Po7F+cg0BDYGiI7exc+nkYZETqHhn27eCyPQay2CWvqGpIGPTiRHakcXVkkRz61xNS8MWjrF+AKUbrh9Xl6cu6oRtQ8xUiWgSmx05xMlfToEHF0Fz364uxrC8uKTwWRQPJWpT6N3qg4b9XEYoAsaoIp6zBjNJCjmwGODxCagl1dxQuNKO7sFrUKsGFVE+DvXKJ95yuo1KZPW2Tm4fQPHZIwTHPjMeaDTsuEGKsSYZu2qWoxqecqBCMDgEni/qXYLa8wkpy5TgeNx6Zy9Wfc4at6Eb0jL5FiALK0m0e2+kI0Ry4ahymJdreHHajrF5RsChOzOFYY8e2vmY3hpcE57Dz10EWsbkEldLzuJgk1MOxSYifa9XdgEHbIeZgCy6VsVUzGTpbiZcu6XbaW+D0UYZ0aE+TWsU82hH8En0hDBVj6Xfb2FzNta+WfSjs0Pj3oxpbsUc1UlwE5E202+Lj0IAebKw+PRpWtPBRLJ7HUspEmFtHDajND8IE+eimKeOcc8P+DU6NZcuIZa9BuNZDKHtMFudN6px8LmwOUONMify6OPEBSFMbWtbUnDIxrsUFKuxFOUUJ5XSHEpLqHPqpPTFqUfUoXhtKnmcgj6ATFI+8PTYVKPj0tr5yal0uNJawSxVQFFUc2blT5ncIFQQ7pWAPF4KJP5cs8PEdNTD4aoBOCzAGZdiUe6gDZSvF7Q4GSwhpr0a3WWxySS3SbVE7Vum1UhPM5Akv3mfpqmUSe50CVjZkGp1z8X7fDcCBVfv0JoaF2ukRzfcuRmyAlEfKzJRHAvnU7qClBinPyP7oDUrT2A1VcV4ZIbJumqdWlt3zqjXdQFQ9FTPCg25joRETX64sVvlIaPTW5I0FobcfVJETm4qtPAWduNqiPJANkOvnH7hzC7jdi/agLm3ijSH7iU+tGsMXw5bmGdlFeHbffDrD6CE28pQJo8GYfUBVgnpVUPBO0wy2/HMAyPr0QeLoQBuX4EOyeGVkFqj5vHUORO2Ql6bD6DjWe9UaBgLdcn3qQoUyw0ZrsIal4CUnVOIc5ipwh3ML050NwsMR4TTxYgIW6SVUKiCD6B2cqh8tDINSMgMMYkboqVl0wSVM4ortulr4pDdHsDHC8fwJTh7+Zahdridpoi5DO3xA0ib8yEJK7niphAhlmkmUrHSDRVRS6RP4CODXoKs0vQa4Dk6z24lfg2XbdzIILfta/S51OIabjKBy5Kmb+Qr4Y+yFNVrdJ0Wm10P0AkgtdvgqJRvr3dT07RRz8/pfp6hNe/u6/gZ2QQen+/w0dz3oHLmTb7YyhLJ86ldrRlknLPMkRjQNA7YN8oZM5ABwaALK/dXIj3IRvS7pTYEkXxaGTXQk8Nt0AtsPFsc1xbUrVdX4nPf+sVNM/aPh0JWZv6LI+FT8PuJ8/Xnl9cw8l/+fciSOgrf/O2Xf7uwzjdOlNj/eEnHsR1+BsE+KiNviN7qxi+jr5+H069BU4Ev/6azEkvdPgdReVn9+uW1aqZ6fD/Svr28vbzGwxvk+eQBjzzcx6EIJz3yaxQPX6fhbYmG8Q3+6lXe3tTeMrzj/gy+fnl5fxBMmyr6fl3HA/Z5OUf98Av2Ff6pH7I9+gWGMAI/Hn5a/nCXen3405hVUfPLAYJ+6qPx/UT/C/JT3fTRMLdNP/70rY7GMJq/I0Ofv6+tFxReEn2b2tAb37019lP00fw07rXyiuj1/SIJgsdvO7VtNL4FTfhs//TY29g0ZZGNj+Z+8re3968kqobPlsdI/vjUd8DQG71HVx0Pb0FTVc27n5+dzzxC0JRlFIxZU7/P7LOHeLfnNauH0SvL30z4bPk2bu0jDryseUj+ZnPtVdEnypuXRPX4EBhGrx+/DVE/Z48Iir1yeCDOz2zH+0PEVxj6+u7BfqqDKvzuqPeIeHl72qBShvAL2LQj+FRQev7w/RL0s/rnf3sXeEmi6uX7QF/y4d3e/9aj3jK8DWHxFjR99D+EGKKgj8ah8movifrnTKXfZ+idgFE9Z31TV1E9vrR9E06P6fhjR+uN6ctf+6YZv4VZHwVj029/A38n8L7pvr29C7x9CLz8briP2Hp5e0uzqPe+p5Oe/f84av6ADX4OC3wAfN28qnxorJpwKqO3fz4+8K+/u/sb+Hxu+Pnvnvne8eXlxWvb8u9t+P8OrPLqLI6GcQCHbIy+tu3rl9dhSL+FURmNURFtwwcb35ufDe9BGAXh4H1r+2x+MvaZMftdtkxRWfl2E15UXbxTBvu+Pn6ujD5Kl34t794Jfj/wj2HOUu8fmsdnvzLfL1m/IidXo3770O9f3uNKLh8gDqLvzg3ePZ7dJAtvA1RfrrmJvMuc+D/ea5q2esHtykHpysUIfLNZ/gGSaFhMVtHKp6R1pCAnxnLP3gwxGYOwFTSL3Vf6ilXbZBJcKx7JKydXarXcgaV3bWx5biW3/Aa/a2kuxuJmXkHwTvWwAbnnriCnki03jiGOflXuoUBtsuG8d4u/3T9Ano00TTNcu4qLfRPYO+jfz4Hm0UwKIu6R9QTYHxg9BTO5jc/X7ASvSBHSjqGy7P4AyfwLbixWkc/QYiIO4NP28TSWcc5wF1l6ODalzrI1R7f7tnnVTAQiu7KBaa5M03nPTT9FokDhqssxHFBuudnPCWBP1KJxdBL88uUPe+B/MdG/Rcnkl1nwESSPxrch9ZC3OhvGFsEPLz/irf+po/6Jj355DDxEcBwm/9cD/Lq8f4/PyQyQZHQtbZMNc1XeBU+Mek3uLs+O3TakIEyHKh6KEy11UM/DQnmES+oUa8LIzPpCUQ8QSkz0sy977M3areSJ/iPAD5B/hE6xVGpfaUy8LiQOjxR10CfhTsFLgSuTFrRXhkhuKDJdjnHyAPECYqPvhXND+ssmgCYHgSWUYezU3wbfjOzZMqkzSUWQQgq/D7kfCLffZu2PATcM6dv3rkegndDHxJQuI8KyweKP6Lr+64N7V9X/769+J+4RHOFncAS1nD66F5ai3oUTlhrNgfYTp+sv54JyBs5zpDW62US6ScSlOiAs2jiXBH0eysqZxQRxlJPGvSsQdAP4iNBECDQNbbLKq9bvt6tO0Md4uE5dzqXAXso3pY4Ek1Mt+GY/V79ql0Z3w3TcHyh6jMfSOkogAY7ajHGYh10Js+BNudnGC71dA0zAgGgWkfVmmKuQz8+Tr1N60SbRGHLUDP9cHrpaslYlDA0ndNlT1+sW1Rd37lIFkKkHV3xXrF0X5C3LAXU1BfQBwt0lsru4UrwRDYhKZEAWsXM53GIvzbjiAjcTnqI8vPCALgnAOhEY6StiaCuDFVzU7GnORQLkOWEyBYSbqGTkoz7clSCwA/1w2QuwKFATPAzi1eRy1B3NNN1WpGoFRxs5w4j6Z17ZsqfFb3UdYuaEWpaj1Z7SSLE5AVhvrMpZKc9Ch4ldTyJR3eNWhTjER71QXenimhv9+ACpQztgkA2iQReA1hq7rRXXUT2ATh0w5VPZDBYUqkrs2ooUjw4hRMgZYADaFq5wLZrPKWYWDncndLeHLsDC3cLpi9zNMJxe1hzvEqgPjtLauZbZYBlwFYJaBUf3PuxEd2BzQ37uTV5qgDNXBUHMdq2k2UcIs4d2Py+FfD83hk7nyKa524W+ykcE2TaZ3J34SAiOFde9enjmkQfE9XQLta74wGMBrgA2ltvdMWgJCd371TzVkMvHXJA37YZe6+G4UT5AEkazb7cclJ+1iFN6pSgqwGic6kUq0i7bgwBCgMqNZJ9355/Q4LnB/YkLP0qDB8ifufCjNHiA/JkLP0qDB8ifufCjNHiA/JkLP0qD7479Ixd+lAYPkD9z4Udp8HTsn7jwozR4EvBPXPhRGjzf6/7EhR+lwQPkz1x40oBiKO25NVCUgl8vuoHQmVCazQHqo+w0RqaYWYHD3ZEHyHq5yKt1F0YMsFhJgh07qfbsbrRR45xhpWAX6U44NufMqaXEsm30Ir0zlVKn3nWXpicBm9Tc5xNwoiBuY1rzZKgH31PKua0R63pb6Cs1c+gtU7LARvwzl2jLhlppIBQ8wiX48Fxj18gNKYggW/IKK0yVkXlKEBy79IHLe44vL16vkuNZk5LUnGDamnUZLK/miUbVGCGzp2OZAhtK6m4LKAo03KDZUGb4lphOgp+1kn5vnMw+99vNyDYovjRX4z6Utw3ZOmRbL8v6fLO5bDqKNsGCkXXimr4/BTXXnKst2RI4YSi3ugANOyEkVAoEKEAGtDO9NpYAcD5TQuA/izbsBKiRzJezgAjTQLIKUvOW09xGNIOigDG9WYa9BMClUz/Q9xIKWM2RhkhADHGV5epZ0p5Px5CNjtepItwe25MAxUHRCEiOFthBTE3lOkZ3t9vqs4J1PMS0MeqoPHJlo53p94vzACnwCIUuyEUAJN1dwEDJIDQf7iffSrkdWUqJboKBrLMjq3BTeBzYamYOKoVr4QKWq/fMLsEgP2Xhoa3q6wUep+56zs9ZwQlR1KhYoStY2I16AEh9dx6aiJ9BhgpqnwHijgGRjnqW+o2bdkxAihmDDuF5MsvKHd+EeiSAtZ8sIOGqrh5PXe5xl91cj/eNvQR3uT0ck9LblOi5PF6qk69L2Vi4Mf14C6Lxg5PwWXmdKr4jUM4VAyu7V4l9i9BtE6W4mmAurw11iyKres6O4lGVs8uVHsaZMnN9x3Rbg6NmHCRMvtupQVzOfprfK+o2k31D3ED1NjFyUo/Bhk8k8Fxj91VwVhy3O2QCZCHlgNPRMo4Hkb5tiLMgTegGerv6g9fs/tZCBS5sd7WToSTLe3IuHiAkck2nbTlx9ELKmbx1mj3RJWRJyLatVdOzm2FP5yI2zqQ3tOBgLbiDbBcYGa/SVVWes0NhHYvuw43FABejrb6wtu42Wqq6Niux348TH09Dh9GMtXIXIrWDkplNAK9dsec0KXu+Th/ydHdMdJC8Ywm1F4FG7pYVVwdZrsYO7gFZsCftSry/idKUjLvzEcOJq7xVoTQ7Ov9MV6+3tkoHz0L1qBbGkZPcO0ZrbHIl3OTWqY2+Tush8e8lQmCIY4l3SbL4CEwsPHJ2iz8935TAq1n7upGwOn4tLI32BtiNboDQWhDFI3jin67HHvPVIfO6ZRgLTZBBa0OEyb6qIew+92Iu0Bh+0zW4otDSuo/zvYFVAI9BvApV5qJFEDKw5eqNJ0EIZ66+xcjsImZrtbeDJD/f2Ty5rQKwxbHFgRXWQ6Mt4cY88HVCWcEMuie85MhmU0BrGhgD7YIVgc/u2vGdyBpM+NwB28WDZ0hx6ak0VSUuCv3O6qbknN3cGax7yW0SBO+K6SdKQZM8n5QpN0yGlrtysmyE/ADh2et3z58Ota7skinaOYJViF9UJ9jpb+py4i6Fn1pQJU+8tdhWQBp3yuAS7wwQz81rRXU0NhzoNkk7sJj+1W+y1jmvglhN4AHi7mssFjBe6DlaHzB1kfVLPg09D6VTM1/x+AGC5YDj8XhjwBKUNqG+C5am2IOBk2ck7u6knlYCukjXWUHvFDKp04HPboHAH8mJ58f1CXLn6dUQ+ubmoAal+17Mq8y9Izqi1UkTSKFbej2dsquyKJupZ4VM6UCDQGke5XnO0tfnlqEMbJC6N3Tdo1zz9TWyj2eBGtGAAqSIGn2ATpvGFsru0NpD51fwpUoR+VBxOYdT3fm5ZQC8sSZHoZgtGCbRoDR25Bawl0jhVteMn6cwShOZf/3I2f99fuP9uNkP3uOoST+PmluAsH/cr7UTfFu4ic66oak0OlvubTJz+DneBHFeOr93jChNOibsLMJIggxCTmlpHg1dwtzjSuUGqcsn3DPX0yyLq7AII7Bsh+5qCUfFhMVDiIWaSfr3c3jxrxNcS6lQTgvFwwBy94cZ3AH4BCZ22if7etNcDckvUCOI657EOX4gcp87ywYbKcCa3dujOAi5P9LyUNldF4w+i8OwnMKFdulGzjlNuml27q7r3LLXV9yX2QC9XFQM5LQ4uJsz0rTFCEpbDgYzvCM6mfTtmex40dJ6KztWQuDblI+zQ3zkj3sOD1gKB4fVXRrgHDQzhgCUIh5BKz2YV3TkVxNf13AVml4xgJsRGmC3JKtmqWEF33hBEjyvCNMTdJflw1C60ZGeSk7QFIBiGGb0iguH4YEZHzlRI+4e6xhGhxmsmG/uHShAzXbnsIVAltc2WZmQEA4X1Zc0gayPBh+nEu9YzWk+Rof+cFAOVrb6OkTgZBlgIwDnS3h0akzFuCDYrSDVG5Wyy+oYy9HW7ikq+wXbIB1oW2zPq1XH3MZ9mPm2dG95JmFLuAUgAJfWrm59c5Ov6LnjVICw3HUlbl0x0vFspNFWX+uTBptVKrO86p/pWmzYBZ19XxJRVE7BeQlTF4gGsEV2t2w5P3T2avHTvTjicSZH/bjVyxwrM6ddYr1wifumZLUUbNE+i/R8RFclV88XlYCWC7v88suX16XPxuhbnJW/1WOC518zX39+eY3WtunHF8q6fWNYjjIl45vO8qIi//JRdvpe8xjTd3kwGgOw7Zt3tK8h6C3D1yF9SkR9lQ1D1tTDuyB0wLDXPyr7z2cO5d/DKPamcvyPZ34qSrKm/tT2B2V904zgV28ZwGcG/x8rgqA/K3ogf6/LfPtdAv1RrflIob/+Qaxvykc1J5+qNm2G8R+Y/VkIib1gjPrHz/A1/N7zqBL8i754/euvn1WRX19//uuvr4FXB1H57VFOqYPoWx/FfTSk35r6W9T3Tf/r68+PQtJPv76GkT8lv7v/U+Xk19eff339L6sTv77+9Ovr72sjj0f+Z/WRB+ZvVYlPvP9WLeOJ9Vlr+ecW/WC95aHgj+WjfzjkX1//9rcfiYSPOf36LMb9i8HwQzqCaRib6p8o+PM/tt/e/vLl/wUAAP//jgoV4RAuAAA="
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.jumphost.aws_lb.jumphost will be updated in-place
  ~ resource "aws_lb" "jumphost" {
        id                                                           = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/net/jumpho20240226175403880200000003/b3fc749d99e1aea6"
        name                                                         = "jumpho20240226175403880200000003"
      ~ tags                                                         = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
          ~ "module_version"    = "3.1.1" -> "3.2.1"
            "service"           = "jumphost"
        }
      ~ tags_all                                                     = {
          ~ "module_version"    = "3.1.1" -> "3.2.1"
            # (5 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.kc_db_password.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/kc_db_password/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_db_password20250601041821930900000003-47bm7K",
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.kc_db_password.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_db_password20250601041821930900000003-47bm7K"
        name                           = "keycloak_db_password20250601041821930900000003"
      ~ tags                           = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/secret/aws"
            "environment"       = "production"
          + "module_version"    = "1.0.3"
            "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
            "service"           = "unknown"
        }
      ~ tags_all                       = {
          + "module_version"    = "1.0.3"
            # (6 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.keycloak_admin_password.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/keycloak_admin_password/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_admin_password20250601041821930600000001-qvqneW",
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.keycloak_admin_password.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_admin_password20250601041821930600000001-qvqneW"
        name                           = "keycloak_admin_password20250601041821930600000001"
      ~ tags                           = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/secret/aws"
            "environment"       = "production"
          + "module_version"    = "1.0.3"
            "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
            "service"           = "unknown"
        }
      ~ tags_all                       = {
          + "module_version"    = "1.0.3"
            # (6 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.mail_twindb_com.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881",
            ]
        }
    }

  # module.mail_twindb_com.aws_autoscaling_group.postfix will be updated in-place
  ~ resource "aws_autoscaling_group" "postfix" {
        id                               = "postfix-20240326221552532900000008-5Qy881"
        name                             = "postfix-20240326221552532900000008-5Qy881"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "28" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      + tag {
          + key                 = "service"
          + propagate_at_launch = true
          + value               = "mta-twindb.com"
        }

        # (6 unchanged blocks hidden)
    }

  # module.mail_twindb_com.aws_efs_file_system.mail will be updated in-place
  ~ resource "aws_efs_file_system" "mail" {
        id                              = "fs-0109046602941ae5d"
        name                            = "mail"
      ~ tags                            = {
            "Name"              = "mail"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all                        = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.mail_twindb_com.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-2024032622160941250000000a"
        name             = "terraform-2024032622160941250000000a"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_launch_template.postfix will be updated in-place
  ~ resource "aws_launch_template" "postfix" {
        id                                   = "lt-0e5d85805b1236e19"
      ~ latest_version                       = 28 -> (known after apply)
        name                                 = "postfix-20240326221552532900000008"
      ~ tags                                 = {
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all                             = {
          + "service"           = "mta-twindb.com"
            # (3 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.mail_twindb_com.aws_lb.postfix will be updated in-place
  ~ resource "aws_lb" "postfix" {
        id                                                           = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/net/postfi20240326221548268900000007/26efeb70ca02a0ad"
        name                                                         = "postfi20240326221548268900000007"
      ~ tags                                                         = {
            "created_by_module" = "infrahouse/postfix/aws"
          + "module_version"    = "0.5.0"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all                                                     = {
          + "module_version"    = "0.5.0"
          + "service"           = "mta-twindb.com"
            # (3 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.mail_twindb_com.aws_lb_target_group.postfix will be updated in-place
  ~ resource "aws_lb_target_group" "postfix" {
        id                                 = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/postfi20240326221547236100000005/dac90856391b4623"
        name                               = "postfi20240326221547236100000005"
      ~ tags                               = {
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all                           = {
          + "service"           = "mta-twindb.com"
            # (3 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.mail_twindb_com.aws_security_group.efs will be updated in-place
  ~ resource "aws_security_group" "efs" {
        id                     = "sg-081bd24660a5aa754"
        name                   = "mail-efs-20240326221547235900000004"
      ~ tags                   = {
            "Name"              = "EFS mail storage"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all               = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_security_group.postfix will be updated in-place
  ~ resource "aws_security_group" "postfix" {
        id                     = "sg-0294b0bcce4c62120"
        name                   = "postfix20240326221547232500000002"
      ~ tags                   = {
            "Name"              = "postfix"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all               = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_vpc_security_group_egress_rule.default will be updated in-place
  ~ resource "aws_vpc_security_group_egress_rule" "default" {
        id                     = "sgr-053feb193fcac08e6"
      ~ tags                   = {
            "Name"              = "outgoing traffic"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all               = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_vpc_security_group_egress_rule.efs will be updated in-place
  ~ resource "aws_vpc_security_group_egress_rule" "efs" {
        id                     = "sgr-0f40ad30271f88e3e"
      ~ tags                   = {
            "Name"              = "EFS outgoing traffic"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all               = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_vpc_security_group_ingress_rule.efs will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "efs" {
        id                     = "sgr-096d1cca0913bfdad"
      ~ tags                   = {
            "Name"              = "NFS traffic"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all               = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_vpc_security_group_ingress_rule.efs_icmp will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "efs_icmp" {
        id                     = "sgr-0ea4b31fe8981f1c1"
      ~ tags                   = {
            "Name"              = "ICMP traffic"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all               = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_vpc_security_group_ingress_rule.icmp will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "icmp" {
        id                     = "sgr-057ebae58c99a47c3"
      ~ tags                   = {
            "Name"              = "ICMP traffic"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all               = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_vpc_security_group_ingress_rule.smtp will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "smtp" {
        id                     = "sgr-086f6961438ffd42b"
      ~ tags                   = {
            "Name"              = "SMTP access"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all               = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_vpc_security_group_ingress_rule.ssh will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "ssh" {
        id                     = "sgr-07100a2bff2e1adef"
      ~ tags                   = {
            "Name"              = "SSH access"
            "created_by_module" = "infrahouse/postfix/aws"
          + "service"           = "mta-twindb.com"
        }
      ~ tags_all               = {
          + "service"           = "mta-twindb.com"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.smtp_credentials.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/smtp_credentials/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:493370826424:secret:smtp_credentials20240707192347968700000001-1tZh8v",
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.smtp_credentials.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:smtp_credentials20240707192347968700000001-1tZh8v"
        name                           = "smtp_credentials20240707192347968700000001"
      ~ tags                           = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/secret/aws"
            "environment"       = "production"
          + "module_version"    = "1.0.3"
            "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
            "service"           = "unknown"
        }
      ~ tags_all                       = {
          + "module_version"    = "1.0.3"
            # (6 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.jumphost.module.jumphost_profile.aws_iam_policy.profile will be updated in-place
  ~ resource "aws_iam_policy" "profile" {
        id               = "arn:aws:iam::493370826424:policy/jumphost-Zv01ElhajbB620240223005112022800000002"
        name             = "jumphost-Zv01ElhajbB620240223005112022800000002"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ec2:DescribeInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "created_by_module" = "infrahouse/instance-profile/aws"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 25 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDAsICJjaGFuZ2UiOiAyNSwgImRlc3Ryb3kiOiAxfX0=
```
</details>